tap "anomalyco/tap", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# Cross-platform make
brew "cmake"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Client library for huggingface.co hub
brew "hf"
# Command-line benchmarking tool
brew "hyperfine"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# AI image upscaling for Apple Silicon
brew "tigger04/tap/superscale"
# Voice and text chat software
cask "discord"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Minecraft launcher
cask "prismlauncher"
# Mesh VPN based on WireGuard
cask "tailscale-app"
npm "@earendil-works/pi-coding-agent"
npm "@gitlawb/zero"
